// Всичко което е текст в контекста на c#, последователи от всякакви чарактери се нарича String.
// Стойностите на променливите се присвоятат чрез знака = 
// Стринговете се слагат вкавички, те са емютъбъл(нещо не може да бъде променяно), мютъбъл(може да бъде променяно)
// Всички стрингове използват Unicode т.е може да съхраняват всякакви символи в тях.
// Самия стринг се нарича Литерал.
// 

//string text = "Hello world!";

//text = text + "UPDATED!";

///////////////////////////////////////////////

//string firstWord = "Hey";
//string secondWord = "World?";

//Console.WriteLine(firstWord);
//Console.WriteLine(string.Concat(firstWord, secondWord));

//////////////////////////////////////////////////////////////////

//string wordA = "Hey!";
//string wordB = "Hello!";
//string wordC = "Holla!";

//Console.WriteLine(string.Join("|", wordA, wordB, wordC));


/////////////////////////////////////////////////////////////////////////


// IndexOf - приема стринг в себе си и търси този стринг вътре в друг стринг взима индекса първия път в който среще стринга
//търси от пред назад
// lastIndexOf от зад на пред
// Conteins 
// Substring